namespace PetFamily.Domain.Models.Volunteer;

public class Volunteer
{
    // Id
    // ФИО
    // Email
    // Общее описание
    // Опыт в годах
    // Количество домашних животных, которые смогли найти дом (это должен быть метод, который берёт список животных и считает количество по их статусу)
    // Количество домашних животных, которые ищут дом в данный момент времени (это должен быть метод, который берёт список животных и считает количество по их статусу)
    // Количество животных, которые сейчас находятся на лечении (это должен быть метод, который берёт список животных и считает количество по их статусу)
    // Номер телефона
    // Социальные сети (список соц. сетей, у каждой социальной сети должна быть ссылка и название), поэтому нужно сделать отдельный класс для социальной сети. Это должен быть Value Object.
    // Реквизиты для помощи (у каждого реквизита будет название и описание, как сделать перевод), поэтому нужно сделать отдельный класс для реквизита. Это должен быть Value Object.
    // Список домашних животных, которыми владеет волонтёр.
}